<?xml version="1.0"?>
<net name="onnx_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="input_image" type="Parameter" version="opset1">
			<data shape="1,3,256,256" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input_image">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_18939_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3, 1, 1" offset="0" size="6" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_18939" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Multiply_27422" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_27424" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="6" size="12" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="/0/Div" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/0/Div_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="onnx::Conv_1256_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 3, 3, 3" offset="18" size="1728" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_1256">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="onnx::Conv_1256" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/1/layer1/layer1.0/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Reshape_15182_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="1746" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Reshape_15182" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/1/layer1/layer1.0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/1/layer1/layer1.0/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/1/layer1/layer1.2/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/1/layer1/layer1.2/Clip_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Reshape_15195_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 3, 3" offset="1810" size="576" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Reshape_15195" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/1/layer1/layer1.3/layer1.3.0/conv_dw/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Reshape_15245_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="2386" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Reshape_15245" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/1/layer1/layer1.3/layer1.3.0/conv_dw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/1/layer1/layer1.3/layer1.3.0/conv_dw/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/1/layer1/layer1.3/layer1.3.0/act1/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/1/layer1/layer1.3/layer1.3.0/act1/Clip_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="onnx::Conv_1262_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="24, 32, 1, 1" offset="2450" size="1536" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_1262">
					<dim>24</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="onnx::Conv_1262" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>24</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/1/layer1/layer1.3/layer1.3.0/conv_pw/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Reshape_15262_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 24, 1, 1" offset="3986" size="48" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Reshape_15262" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/1/layer1/layer1.3/layer1.3.0/conv_pw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/1/layer1/layer1.3/layer1.3.0/conv_pw/Conv_output_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="onnx::Conv_1265_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="144, 24, 1, 1" offset="4034" size="6912" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_1265">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="onnx::Conv_1265" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/1/layer1/layer1.4/layer1.4.0/conv_pw/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Reshape_15277_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="10946" size="288" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Reshape_15277" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/1/layer1/layer1.4/layer1.4.0/conv_pw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/1/layer1/layer1.4/layer1.4.0/conv_pw/Conv_output_0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/1/layer1/layer1.4/layer1.4.0/act1/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/1/layer1/layer1.4/layer1.4.0/act1/Clip_output_0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="ShapeOf_30252" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_30253" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="11234" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="35" name="Constant_30254" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="11242" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="36" name="Gather_30255" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="37" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="11250" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Constant_7_output_0" />
			</output>
		</layer>
		<layer id="38" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Div_1" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Cast_2_output_0,/1/layer1/layer1.4/layer1.4.0/conv_dw/Cast_3_output_0,/1/layer1/layer1.4/layer1.4.0/conv_dw/Div_1_output_0" />
			</output>
		</layer>
		<layer id="39" name="Constant_27431" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="11250" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="40" name="Multiply_27426" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" />
			</output>
		</layer>
		<layer id="41" name="Constant_27437" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="11258" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="42" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Add_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Add_3_output_0" />
			</output>
		</layer>
		<layer id="43" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Sub_3" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Sub_3_output_0" />
			</output>
		</layer>
		<layer id="44" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Constant_12" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="11266" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Constant_12_output_0" />
			</output>
		</layer>
		<layer id="45" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Div_2" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Cast_4_output_0,/1/layer1/layer1.4/layer1.4.0/conv_dw/Cast_5_output_0,/1/layer1/layer1.4/layer1.4.0/conv_dw/Div_2_output_0" />
			</output>
		</layer>
		<layer id="46" name="Constant_87" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="11242" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_602">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Unsqueeze_4" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Unsqueeze_4_output_0,/1/layer1/layer1.4/layer1.4.0/conv_dw/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Sub_4" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Sub_4_output_0" />
			</output>
		</layer>
		<layer id="49" name="Constant_89" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="11242" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_604">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Unsqueeze_5" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Unsqueeze_1_output_0,/1/layer1/layer1.4/layer1.4.0/conv_dw/Unsqueeze_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_30257" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="11266" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="52" name="Constant_30258" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="11242" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="53" name="Gather_30259" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Gather_output_0" />
			</output>
		</layer>
		<layer id="54" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="11250" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="55" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Cast_1_output_0,/1/layer1/layer1.4/layer1.4.0/conv_dw/Cast_output_0,/1/layer1/layer1.4/layer1.4.0/conv_dw/Div_output_0" />
			</output>
		</layer>
		<layer id="56" name="Constant_27444" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="11250" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="57" name="Multiply_27439" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" />
			</output>
		</layer>
		<layer id="58" name="Constant_27450" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="11258" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="59" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Add_1_output_0" />
			</output>
		</layer>
		<layer id="60" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Sub_1" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Sub_1_output_0" />
			</output>
		</layer>
		<layer id="61" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Constant_13" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="11266" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Constant_13_output_0" />
			</output>
		</layer>
		<layer id="62" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Div_3" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Cast_6_output_0,/1/layer1/layer1.4/layer1.4.0/conv_dw/Cast_7_output_0,/1/layer1/layer1.4/layer1.4.0/conv_dw/Div_3_output_0" />
			</output>
		</layer>
		<layer id="63" name="Constant_91" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="11242" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_606">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Unsqueeze_6" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Unsqueeze_2_output_0,/1/layer1/layer1.4/layer1.4.0/conv_dw/Unsqueeze_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Sub_5" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Sub_5_output_0" />
			</output>
		</layer>
		<layer id="66" name="Constant_93" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="11242" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Unsqueeze_608">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Unsqueeze_7" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Unsqueeze_3_output_0,/1/layer1/layer1.4/layer1.4.0/conv_dw/Unsqueeze_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/ConstantOfShape" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="11274" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/ConstantOfShape_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Concat_2" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Concat_2_output_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Constant_16" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="11306" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Constant_16_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Reshape_output_0">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Constant_18" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="11322" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Constant_18_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Constant_19" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="11330" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Constant_19_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Constant_20" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="11322" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Constant_20_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Constant_17" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="11242" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Constant_17_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Slice" type="Slice" version="opset8">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Slice_output_0">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_15336" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="11338" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Transpose_output_0">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_20604" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="11322" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Cast_9_output_0,/1/layer1/layer1.4/layer1.4.0/conv_dw/Reshape_1_output_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_15340" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="11242" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="82" name="Split_15341" type="Split" version="opset1">
			<data num_splits="2" />
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Constant_22_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="11354" size="2" />
			<output>
				<port id="0" precision="FP16" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Constant_22_output_0" />
			</output>
		</layer>
		<layer id="84" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Constant_22" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="85" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Pad" type="Pad" version="opset12">
			<data pad_mode="constant" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32" />
			</input>
			<output>
				<port id="4" precision="FP32" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Pad_output_0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Reshape_15544_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="144, 1, 1, 3, 3" offset="11356" size="2592" />
			<output>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Reshape_15544" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>129</dim>
					<dim>129</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Reshape_15594_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 144, 1, 1" offset="13948" size="288" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Reshape_15594" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/1/layer1/layer1.4/layer1.4.0/conv_dw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/1/layer1/layer1.4/layer1.4.0/conv_dw/Conv_output_0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/1/layer1/layer1.4/layer1.4.0/act2/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/1/layer1/layer1.4/layer1.4.0/act2/Clip_output_0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="onnx::Conv_1271_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 144, 1, 1" offset="14236" size="9216" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_1271">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="onnx::Conv_1271" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/1/layer1/layer1.4/layer1.4.0/conv_pwl/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Reshape_15611" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="23452" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/1/layer1/layer1.4/layer1.4.0/conv_pwl/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/1/layer1/layer1.4/layer1.4.0/conv_pwl/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="onnx::Conv_1274_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="192, 32, 1, 1" offset="23580" size="12288" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_1274">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="onnx::Conv_1274" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/1/layer1/layer1.4/layer1.4.1/conv_pw/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Reshape_15626_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 192, 1, 1" offset="35868" size="384" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Reshape_15626" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/1/layer1/layer1.4/layer1.4.1/conv_pw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/1/layer1/layer1.4/layer1.4.1/conv_pw/Conv_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/1/layer1/layer1.4/layer1.4.1/act1/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/1/layer1/layer1.4/layer1.4.1/act1/Clip_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Reshape_15639_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="192, 1, 1, 3, 3" offset="36252" size="3456" />
			<output>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Reshape_15639" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/1/layer1/layer1.4/layer1.4.1/conv_dw/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Reshape_15689" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="39708" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="/1/layer1/layer1.4/layer1.4.1/conv_dw/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/1/layer1/layer1.4/layer1.4.1/conv_dw/Conv_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="/1/layer1/layer1.4/layer1.4.1/act2/Clip" type="Clamp" version="opset1">
			<data min="0" max="6" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/1/layer1/layer1.4/layer1.4.1/act2/Clip_output_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="onnx::Conv_1280_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 192, 1, 1" offset="40476" size="12288" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_1280">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="onnx::Conv_1280" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="/1/layer1/layer1.4/layer1.4.1/conv_pwl/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Reshape_15706" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="52764" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
