<?xml version="1.0"?>
<net name="onnx_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data shape="1,3,384,384" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="expand_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="0" size="2048" />
			<output>
				<port id="0" precision="FP16" names="expand">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="expand" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="dpt.embeddings.patch_embeddings.projection.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1024, 3, 16, 16" offset="2048" size="1572864" />
			<output>
				<port id="0" precision="FP16" names="dpt.embeddings.patch_embeddings.projection.weight">
					<dim>1024</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="dpt.embeddings.patch_embeddings.projection.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="node_conv2d/WithoutBiases" type="Convolution" version="opset1">
			<data strides="16, 16" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>3</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Reshape_22_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1024, 1, 1" offset="1574912" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Reshape_22" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="node_conv2d" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="conv2d">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="val_42" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1576960" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="val_42">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="node_view_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="view_2">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>576</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_30" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1576984" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="node_transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>576</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="transpose">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="node_cat_1" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>576</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="cat_1">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="node_cat_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 577, 1024" offset="1577008" size="1181696" />
			<output>
				<port id="0" precision="FP16" names="cat">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="node_cat" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="node_add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="add">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Range_51" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2758704" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="MVN_52" type="MVN" version="opset6">
			<data eps="9.999999960041972e-13" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_12041_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="2758712" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_12041" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Multiply_59" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_12042_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="2760760" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_12042" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="node_layer_norm" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer_norm">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Transpose_7717_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1024, 1024" offset="2762808" size="2097152" />
			<output>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Transpose_7717" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="node_MatMul_65" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="val_67">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_12043_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="4859960" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_12043" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="node_linear_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="linear_2">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="val_57" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="4862008" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="val_57">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="node_view_5" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="view_5">
					<dim>1</dim>
					<dim>577</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_81" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="4862040" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="node_transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="transpose_3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>577</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_12044" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="4862072" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="node_Mul_89" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>577</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="val_91">
					<dim>1</dim>
					<dim>16</dim>
					<dim>577</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Transpose_7724_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1024, 1024" offset="4862076" size="2097152" />
			<output>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Transpose_7724" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="node_MatMul_49" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="val_51">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_12045_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="6959228" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_12045" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="node_linear" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="linear">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="node_view_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="view_3">
					<dim>1</dim>
					<dim>577</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_77" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="4862040" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="node_transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="transpose_1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>577</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="val_85" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="6961276" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="val_85">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="node_Reshape_84" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>577</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="val_86">
					<dim>16</dim>
					<dim>577</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_87" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1576984" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="node_Transpose_85" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>577</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="val_87">
					<dim>16</dim>
					<dim>64</dim>
					<dim>577</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="val_88" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="6961300" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="val_88">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="node_Reshape_87" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>64</dim>
					<dim>577</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="val_89">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>577</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_10968" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="6961332" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Transpose_10969" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>577</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>577</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Transpose_7731_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1024, 1024" offset="6961364" size="2097152" />
			<output>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Transpose_7731" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="node_MatMul_57" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="val_59">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_12046_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="9058516" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_12046" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="node_linear_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="linear_1">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="node_view_4" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="view_4">
					<dim>1</dim>
					<dim>577</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_79" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="4862040" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="node_transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="transpose_2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>577</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_10967_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="9060564" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="64" name="Constant_10967" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="65" name="val_90" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="4862072" size="4" />
			<output>
				<port id="0" precision="FP32" names="val_90" />
			</output>
		</layer>
		<layer id="66" name="node_scaled_dot_product_attention" type="ScaledDotProductAttention" version="opset13">
			<data causal="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>577</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>577</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>577</dim>
					<dim>64</dim>
				</port>
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32" names="scaled_dot_product_attention">
					<dim>1</dim>
					<dim>16</dim>
					<dim>577</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_95" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="4862040" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="node_transpose_4" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>577</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="transpose_4">
					<dim>1</dim>
					<dim>577</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="val_101" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="9060566" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="val_101">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="node_view_6" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="view_6">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Transpose_7736_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1024, 1024" offset="9060590" size="2097152" />
			<output>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Transpose_7736" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="node_MatMul_101" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="val_103">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_12047_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="11157742" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_12047" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="node_linear_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="linear_3">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="node_add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="add_1">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Range_109" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2758704" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="MVN_110" type="MVN" version="opset6">
			<data eps="9.999999960041972e-13" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_12048_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="11159790" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_12048" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Multiply_117" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_12049_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="11161838" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_12049" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="node_layer_norm_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer_norm_1">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Transpose_7747_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="4096, 1024" offset="11163886" size="8388608" />
			<output>
				<port id="0" precision="FP16">
					<dim>4096</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Transpose_7747" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>4096</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4096</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="node_MatMul_103" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4096</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="val_107">
					<dim>1</dim>
					<dim>577</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_12050_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 4096" offset="19552494" size="8192" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_12050" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="node_linear_4" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>4096</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="linear_4">
					<dim>1</dim>
					<dim>577</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="node_gelu" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="gelu">
					<dim>1</dim>
					<dim>577</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Transpose_7752_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1024, 4096" offset="19560686" size="8388608" />
			<output>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Transpose_7752" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>4096</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="node_MatMul_112" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>4096</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>4096</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="val_116">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_12051_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="27949294" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_12051" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="node_linear_5" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="linear_5">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="node_add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="add_2">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Range_141" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2758704" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="MVN_142" type="MVN" version="opset6">
			<data eps="9.999999960041972e-13" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_12052_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="27951342" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_12052" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Multiply_149" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_12053_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="27953390" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_12053" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="node_layer_norm_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="layer_norm_2">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Transpose_7763_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1024, 1024" offset="27955438" size="2097152" />
			<output>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Transpose_7763" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="node_MatMul_130" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="val_136">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_12054_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="30052590" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_12054" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="node_linear_8" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="linear_8">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="node_view_9" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="view_9">
					<dim>1</dim>
					<dim>577</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Constant_170" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="4862040" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="node_transpose_7" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="transpose_7">
					<dim>1</dim>
					<dim>16</dim>
					<dim>577</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Constant_12055" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="4862072" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="node_Mul_151" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>577</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="val_157">
					<dim>1</dim>
					<dim>16</dim>
					<dim>577</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Transpose_7770_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1024, 1024" offset="30054638" size="2097152" />
			<output>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Transpose_7770" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="node_MatMul_114" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="val_120">
					<dim>1</dim>
					<dim>577</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Constant_12056_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1024" offset="32151790" size="2048" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Constant_12056" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
